Tekla.Structures.Model.RebarCrankingNullable
The RebarCrankingNullable class represents the cranking of reinforcing bars at a Tekla.Structures.Model.RebarEndDetailModifier.

Tekla.Structures.Model.RebarCrankingNullable.#ctor
Initializes a new instance of the Tekla.Structures.Model.RebarCrankingNullable class.

Tekla.Structures.Model.RebarCrankingNullable.CrankRotation
Gets or sets the crank rotation.

Tekla.Structures.Model.RebarCrankingNullable.CrankStraightLength
Gets or sets the crank straight length.

Tekla.Structures.Model.RebarCrankingNullable.CrankedLengthType
Gets or sets the cranked length type.

Tekla.Structures.Model.RebarCrankingNullable.CrankedRatio
Gets or sets the cranked ratio.

Tekla.Structures.Model.RebarCrankingNullable.CrankedDistance
Gets or sets the cranked distance.

Tekla.Structures.Model.RebarCrankingNullable.CrankedOffset
Gets or sets the cranked offset.

Tekla.Structures.Model.RebarCrankingNullable.CrankingType
Gets or sets the cranking type.

Tekla.Structures.Model.RebarCrankingNullable.ToStruct(Tekla.Structures.ModelInternal.dotRebarCranking_t@)
The to struct method.
dotCranking: The rebar cranking struct.

Tekla.Structures.Model.RebarCrankingNullable.FromStruct(Tekla.Structures.ModelInternal.dotRebarCranking_t@)
The from struct method.
dotCranking: The rebar cranking struct.